package task3;

/**Напишите обобщенный класс Pair, который представляет собой
пару значений разного типа. Класс должен иметь методы
getFirst(), getSecond() для получения значений каждого
из составляющих пары, а также переопределение метода
toString(), возвращающее строковое представление пары.
Работу сдать в виде ссылки на гит репозиторий.
 */
public class Main {
    public static void main(String[] args) {

        Pair b = new Pair(1,"Gulpreet Kaur");
        //System.out.println(b);
        System.out.println(b);

    }
}
